{
  "templates": [
    {
      "id": 1,
      "name": "AI/ML Professional Template",
      "subject": "Application for AI/ML Engineering Internship - {{COMPANY_NAME}}",
      "content": "Dear {{HR_NAME}},\n\nI hope this message finds you well.\n\nI am Karrtik Gupta, a third-year Electronics and Communication Engineering student specializing in Artificial Intelligence and Machine Learning. I am reaching out to express my strong interest in joining {{COMPANY_NAME}} as an AI/ML Engineering Intern for a 6-month tenure beginning in 2026.\n\nThroughout my academic journey and hands-on project experience, I have developed strong expertise in:\n\n• Generative AI: Architected production-ready AI agents using Gemini API and Node.js, including \"VoiceCart\" and \"AI Summary Pro,\" automating complex workflows and enhancing user experience\n\n• Computer Vision: Trained and optimized custom YOLOv8 models achieving 92% mean Average Precision (mAP) for real-time object detection applications\n\n• Full-Stack Development: Built scalable web applications using React, Node.js, Express, and Firebase, handling authentication, real-time data synchronization, and RESTful APIs\n\n• Cloud Computing: Deployed and validated machine learning models on Microsoft Azure, managing end-to-end ML project lifecycles\n\n• Programming: Proficient in Python, C++, and JavaScript with strong foundations in Data Structures, Algorithms, and Object-Oriented Programming\n\nI have enclosed my resume for your review, and you may also view my portfolio at kartikgupta.vercel.app for detailed project demonstrations.\n\n\nI would greatly appreciate the opportunity to discuss how I can contribute to your organization's goals. Please let me know if there is a convenient time for a conversation.\n\nThank you for considering my application. I look forward to your response.\n\nBest regards,\nKarrtik Gupta\n+91 9821726242\nLinkedIn: https://www.linkedin.com/in/karrtik-gupta/\nPortfolio: karrtikgupta.vercel.app",
      "isDefault": false
    },
    {
      "id": 2,
      "name": "SDE Professional Template",
      "subject": "Application for Software Development Engineer Internship - {{COMPANY_NAME}}",
      "content": "Dear {{HR_NAME}},\n\nI hope this email finds you well.\n\nI am Karrtik Gupta, a third-year engineering student with a strong passion for full-stack software development. I am writing to express my interest in the Software Development Engineer Internship opportunity at {{COMPANY_NAME}} for a 6-month period beginning in 2026.\n\nI have gained substantial experience building scalable, production-ready applications, and my technical expertise includes:\n\n• Backend Development: Designed and implemented robust server-side architectures using Node.js and Express.js, building RESTful APIs that serve over 2,000+ active users with optimized performance and security\n\n• Frontend Development: Created responsive, intuitive user interfaces using React, focusing on real-time data synchronization and exceptional user experience\n\n• Database Management: Experienced with both NoSQL (Firebase Firestore) and SQL databases (PostgreSQL, MySQL), implementing efficient data models and queries\n\n• Cloud & DevOps: Deployed applications on Microsoft Azure with experience in containerization (Docker) and version control (Git/GitHub)\n\n• Programming Fundamentals: Strong command of C++, Python, and JavaScript with solid understanding of Data Structures, Algorithms, Object-Oriented Programming, and Database Management Systems\n\nMy enclosed resume and portfolio (karrtikgupta.vercel.app) provide comprehensive details about my projects and technical accomplishments.\n\n. I am eager to bring my technical skills, problem-solving abilities, and enthusiasm to your engineering team.\n\nI would be grateful for the opportunity to discuss how I can contribute to {{COMPANY_NAME}}'s success. Please let me know if you would be available for a conversation at your convenience.\n\nThank you very much for considering my application. I am look forward to hearing from you.\n\nBest regards,\nKarrtik Gupta\n+91 9821726242\nLinkedIn: linkedin.com/in/karrtik-gupta\nPortfolio: karrtikgupta.vercel.app",
      "isDefault": true
    },
    {
      "id": 3,
      "name": "General Professional Template",
      "subject": "Engineering Internship Application - {{COMPANY_NAME}}",
      "content": "Dear {{HR_NAME}},\n\nI hope you are doing well.\n\nMy name is Karrtik Gupta, and I am a third-year engineering student specializing in Electronics, Communication, and Artificial Intelligence. I am writing to inquire about potential internship opportunities at {{COMPANY_NAME}} for 2026.\n\nI have developed strong technical skills through academic coursework and practical project implementations:\n\n• Software Development: Full-stack web development using React, Node.js, Express, and Firebase\n• Machine Learning: Experience with computer vision, generative AI, and model deployment\n• Programming: Proficient in Python, C++, and JavaScript\n• Cloud Technologies: Hands-on experience with Microsoft Azure\n• Core Competencies: Data Structures, Algorithms, Object-Oriented Programming, and Database Management\n\nI am impressed by {{COMPANY_NAME}}'s innovative work and would be honored to contribute to your team. I have attached my resume for your review, and my portfolio can be viewed at kartikgupta.vercel.app.\n\nI would welcome the opportunity to discuss how my skills and enthusiasm align with the needs of your organization. Please let me know if you would be open to a conversation.\n\nThank you for taking the time to consider my application. I look forward to your response.\n\nWarm regards,\nKarrtik Gupta\n+91 [Your Phone Number]\nLinkedIn: linkedin.com/in/karttik-gupta\nPortfolio: kartikgupta.vercel.app",
      "isDefault": false
    }
  ],
  "templateIdCounter": 4,
  "lastUpdated": "2025-11-07T00:00:00.000Z"
}